# PointNode Methods

---
The PointNode type exposes the following members.
| Name| Description
---|---|---
| Dispose| (Inherited from RenderNode)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetPoint|  Returns the point object corresponding to the node.
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
PointNode Class
Autodesk.Revit.DB Namespace